<template>
  <div class="docs">
    <div class="container">
      <div class="docs__wrapper">
        <h1 class="docs__title">Политика конфиденциальности</h1>
        <div class="docs__block">
          <p>Настоящая Политика конфиденциальности персональных данных разработана в соответствии с требованиями Федерального закона Российской Федерации от 27.07.2006 № 152-ФЗ «О персональных данных» и определяет порядок обработки персональных данных и меры по обеспечению их безопасности.</p>
        </div>
        <div class="docs__block">
          <h6>1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</h6>
          <p>1.1 В настоящей Политике конфиденциальности используются следующие термины:</p>
          <p>1.1.1. «Оператор персональных данных (далее – Оператор)» – уполномоченные на управление сайтом сотрудники компании, которые организуют и (или) осуществляют обработку персональных данных, а также определяют цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.</p>
          <p>1.1.2. «Персональные данные» — любые данные, относящиеся прямо или косвенно к определенному физическому лицу (субъекту персональных данных).</p>
          <p>1.1.3. «Обработка персональных данных» — любое действие или совокупность действий, совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, обновление, извлечение, использование, передачу (распространение, предоставление доступа), обезличивание, блокирование, удаление персональных данных.</p>
          <p>1.1.4. «Конфиденциальность персональных данных» — обязательное для соблюдения Оператором или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.</p>
          <p>1.1.5. «Пользователь сайта» (далее — Пользователь) – лицо, имеющее доступ к Сайту, через сеть Интернет и использующее Сайт.</p>
          <p>1.1.6. «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу IP.</p>
        </div>
        <div class="docs__block">
          <h6>2. ОБЩИЕ ПОЛОЖЕНИЯ</h6>
          <p>2.1. Оператор персональных данных: ООО “АЙТИ РЕШЕНИЯ”, адрес: [адрес], электронная почта: [email].</p>
          <p>2.2. Оператор осуществляет обработку персональных данных в соответствии с Федеральным законом Российской Федерации от 27.07.2006 № 152-ФЗ «О персональных данных».</p>
          <p>2.3. Использование сайта означает согласие Пользователя с настоящей Политикой конфиденциальности и условиями обработки персональных данных.</p>
          <p>2.4. В случае несогласия пользователь обязан прекратить использование сайта.</p>
          <p>2.5. Настоящая Политика применяется только к данному сайту. Оператор не несет ответственности за сайты третьих лиц, на которые пользователь может перейти по ссылкам.</p>
          <p>2.6. Оператор персональных данных не проверяет достоверность персональных данных, предоставляемых Пользователем Сайта.</p>
        </div>
        <div class="docs__block">
          <h6>3. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ</h6>
          <p>3.1. Настоящая Политика конфиденциальности устанавливает обязательства Оператора персональных данных по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Оператора при регистрации на Сайте или при оформлении заказа для приобретения Товара, оказания Услуг или выполнения Работ.</p>
          <p>3.2. Персональные данные, разрешенные к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путем заполнения формы на Сайте и могут включать в себя следующую информацию:</p>
          <p>3.2.1. фамилию, имя и/или отчество Пользователя;</p>
          <p>3.2.2. контактный телефон Пользователя;</p>
          <p>3.2.3. адрес электронной почты (e-mail).</p>
          <p>3.3. Оператор обеспечивает защиту персональных данных, которые автоматически передаются в процессе коммуникации Пользователя с Оператором через контактную форму.</p>
        </div>
        <div class="docs__block">
          <h6>4. ЦЕЛИ СБОРА ПЕРСОНАЛЬНЫХ ДАННЫХ ПОЛЬЗОВАТЕЛЯ</h6>
          <p>4.1. Персональные данные Пользователя Оператор может использовать в целях:</p>
          <p>4.1.1. Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования Сайта, оказания услуг, обработка запросов и заявок от Пользователя.</p>
          <p>4.1.2. Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.</p>
          <p>4.1.3. Предоставления Пользователю эффективной клиентской и технической поддержки при возникновении проблем, связанных с использованием Сайта.</p>
        </div>
        <div class="docs__block">
          <h6>5. СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h6>
          <p>5.1. Обработка персональных данных Пользователя осуществляется в течение срока, необходимого для достижения целей обработки, если иной срок не установлен законодательством, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.</p>
          <p>5.2. Пользователь соглашается с тем, что Оператор вправе передавать персональные данные третьим лицам, в частности, курьерским службам, организациям почтовой связи, исключительно в целях оказания услуг.</p>
          <p>5.3. Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти Российской Федерации только по основаниям и в порядке, установленным законодательством Российской Федерации.</p>
          <p>5.4. При утрате или разглашении персональных данных Оператор информирует Пользователя об утрате или разглашении персональных данных.</p>
          <p>5.5. Оператор принимает необходимые организационные и технические меры для защиты персональных данных Пользователя от неправомерного или случайного доступа, уничтожения, изменения, копирования, распространения, а также от иных неправомерных действий третьих лиц.</p>
          <p>5.6. Оператор принимает необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.</p>
        </div>
        <div class="docs__block">
          <h6>6. ПРАВА ПОЛЬЗОВАТЕЛЯ</h6>
          <p>6.1. Пользователь имеет право:</p>
          <p>6.1.1. Получать информацию об использовании своих персональных данных и их обработке;</p>
          <p>6.1.2. Требовать уточнения, блокирования или уничтожения данных;</p>
          <p>6.1.3. Отозвать согласие на обработку персональных данных;</p>
          <p>6.1.4. Обжаловать действия Оператора в уполномоченном органе или в судебном порядке.</p>
        </div>
        <div class="docs__block">
          <h6>7. ОБЯЗАТЕЛЬСТВА СТОРОН</h6>
          <p>7.1. Пользователь обязан:</p>
          <p>7.1.1. Предоставить информацию о персональных данных, необходимую для коммуникации с Оператором.</p>
          <p>7.2. Оператор обязан:</p>
          <p>7.2.1. Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики конфиденциальности.</p>
          <p>7.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, публикацию, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением п.п. 5.2. и 5.3. настоящей Политики конфиденциальности.</p>
          <p>7.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемому для защиты такого рода информации.</p>
          <p>7.2.4. Осуществлять блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных, в случае выявления недостоверных персональных данных или неправомерных действий.</p>
        </div>
        <div class="docs__block">
          <h6>8. ОТВЕТСТВЕННОСТЬ СТОРОН</h6>
          <p>8.1. Оператор, не исполнивший свои обязательства, несет ответственность за убытки, понесенные Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации, за исключением случаев, предусмотренных п.п. 5.2., 5.3. и 7.2. настоящей Политики конфиденциальности.</p>
          <p>8.2. В случае утраты или разглашения конфиденциальной информации Оператор не несет ответственность, если данная конфиденциальная информация:</p>
          <p>8.2.1. Стала публичным достоянием до ее утраты или разглашения.</p>
          <p>8.2.2. Была получена от третьей стороны до момента ее получения Оператором.</p>
          <p>8.2.3. Была разглашена с согласия Пользователя.</p>
        </div>
        <div class="docs__block">
          <h6>9. РАЗРЕШЕНИЕ СПОРОВ</h6>
          <p>9.1. До обращения в суд Сторона вправе направить другой Стороне письменную претензию в целях досудебного урегулирования спора. Обязательный досудебный (претензионный) порядок применяется только в случаях, прямо предусмотренных законодательством Российской Федерации для соответствующей категории споров.</p>
          <p>9.2. Получатель претензии в течение 30 календарных дней со дня получения претензии письменно уведомляет заявителя претензии о результатах рассмотрения претензии.</p>
          <p>9.3. К настоящей Политике конфиденциальности и отношениям между Пользователем и Оператором применяется действующее законодательство Российской Федерации.</p>
        </div>
        <div class="docs__block">
          <h6>10. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ</h6>
          <p>10.1. Оператор вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.</p>
          <p>10.2. Новая редакция Политики вступает в силу с момента ее размещения на сайте, если иное не предусмотрено новой редакцией.</p>
          <p>10.3. Все предложения и вопросы по настоящей Политике следует направлять по адресу электронной почты, указанному в разделе 1.</p>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup>

</script>

<style lang="scss" scoped>
.docs {
  padding-block: 150px;
  background-image: url(@images/docsBg.png);
  background-repeat: no-repeat;
  background-size: cover;
  background-position: center;

  &__wrapper {
    position: relative;
    z-index: 1;
    display: flex;
    flex-direction: column;
    gap: 40px;
  }

  &__title {
    color: #FFF;
    font-family: "Gros Ventre", sans-serif;
    font-size: 70px;
    font-weight: 400;
  }

  &__block {
    display: flex;
    flex-direction: column;
    gap: 8px;

    & h6 {
      color: #FFF;
      text-align: justify;
      font-family: Onest, sans-serif;
      font-size: 20px;
      font-weight: 600;
    }

    & p, li {
      color: #FFF;
      text-align: justify;
      font-family: Onest, sans-serif;
      font-size: 18px;
      font-weight: 400;
    }

    & a {
      transition: 0.2s;
      color: #FF6C40;

      @include hover {
        color: #d04b22;
      }
    }
  }
}

ul {
  padding-left: 30px;
}

@media (max-width: 750px) {
  .docs {
    &__title {
      font-size: 32px;
    }

    &__block {
      & p {
        font-size: 16px;
      }

      & h6 {
        font-size: 16px;
      }
    }
  }
}
</style>