<template>
  <footer class="footer">
    <div class="container">
      <div class="footer__wrapper">
        <div class="footer__left">
          <svg class="footer__left-logo" xmlns="http://www.w3.org/2000/svg" width="270" viewBox="0 0 158 40" fill="none">
            <path d="M70.4451 19.661H67.9918L66.6936 16.654H58.742L57.4437 19.661H55L61.1761 5.84048H64.2594L70.4451 19.661ZM65.9108 14.8421L62.7226 7.44035L59.5247 14.8421H65.9108Z" fill="white"/>
            <path d="M85.1743 19.661H82.9405V8.92456L73.6429 19.661H71.6192V5.84048H73.8529V16.5191L83.1506 5.84048H85.1743V19.661ZM78.8263 4.03822H78.3395C77.6013 4.03822 76.9076 3.85831 76.2585 3.4985C75.6094 3.13227 75.0812 2.64396 74.6739 2.03357C74.273 1.41675 74.0725 0.738895 74.0725 0H76.1344C76.1344 0.610391 76.3476 1.13404 76.774 1.57095C77.2067 2.00787 77.7285 2.22632 78.3395 2.22632H78.8263C79.4372 2.22632 79.9559 2.00787 80.3823 1.57095C80.815 1.13404 81.0314 0.610391 81.0314 0H83.0933C83.0933 0.738895 82.8896 1.41675 82.4823 2.03357C82.0814 2.64396 81.5564 3.13227 80.9073 3.4985C80.2582 3.85831 79.5645 4.03822 78.8263 4.03822Z" fill="white"/>
            <path d="M94.5578 19.661H92.3241V7.64274H86.6634V5.83084H100.218V7.64274H94.5578V19.661Z" fill="white"/>
            <path d="M115.339 19.661H113.105V8.92456L103.808 19.661H101.784V5.84048H104.018V16.5191L113.315 5.84048H115.339V19.661Z" fill="white"/>
            <path d="M57.5197 40H55.3049V26.4501H63.0756C63.694 26.4501 64.2777 26.5667 64.8266 26.7997C65.3756 27.0328 65.8551 27.3541 66.2653 27.7635C66.6754 28.1793 66.9973 28.6612 67.2307 29.2092C67.4705 29.751 67.5904 30.3337 67.5904 30.9573C67.5904 31.7825 67.3853 32.5384 66.9752 33.2251C66.5713 33.9054 66.0255 34.4503 65.3377 34.8597C64.6563 35.2629 63.9022 35.4645 63.0756 35.4645H57.5197V40ZM62.6308 33.6881C63.388 33.6881 64.0347 33.4203 64.5711 32.8849C65.1074 32.3495 65.3756 31.7069 65.3756 30.9573C65.3756 30.2014 65.1074 29.5557 64.5711 29.0203C64.041 28.4848 63.3943 28.2171 62.6308 28.2171H57.5197V33.6881H62.6308Z" fill="white"/>
            <path d="M80.8413 40H69.0859V26.4407H80.8413V28.2171H71.3006V32.3274H80.8413V34.1038H71.3006V38.2236H80.8413V40Z" fill="white"/>
            <path d="M99.1749 40H82.7343V26.4501H84.9491V38.2236H89.8519V26.4501H92.0667V38.2236H96.9601V26.4501H99.1749V40Z" fill="white"/>
            <path d="M112.871 40H101.115V26.4407H112.871V28.2171H103.33V32.3274H112.871V34.1038H103.33V38.2236H112.871V40Z" fill="white"/>
            <path d="M128.204 40H125.989V34.1133H116.978V40H114.764V26.4501H116.978V32.3369H125.989V26.4501H128.204V40Z" fill="white"/>
            <path d="M143.689 40H141.474V29.4738L132.255 40H130.248V26.4501H132.463V36.9196L141.682 26.4501H143.689V40Z" fill="white"/>
            <path d="M157.678 40H155.463V35.4645H151.895L148.194 40H145.392L149.207 35.4078C148.481 35.2881 147.831 35.0204 147.257 34.6046C146.683 34.1889 146.228 33.666 145.894 33.0361C145.559 32.3998 145.392 31.7069 145.392 30.9573C145.392 30.3337 145.509 29.751 145.742 29.2092C145.976 28.6612 146.301 28.1793 146.717 27.7635C147.128 27.3541 147.604 27.0328 148.147 26.7997C148.696 26.5667 149.282 26.4501 149.907 26.4501H157.678V40ZM155.463 33.6881V28.2265H150.342C149.585 28.2265 148.938 28.4943 148.402 29.0297C147.872 29.5652 147.607 30.2077 147.607 30.9573C147.607 31.7132 147.875 32.3589 148.412 32.8943C148.948 33.4235 149.592 33.6881 150.342 33.6881H155.463Z" fill="white"/>
            <g filter="url(#filter0_i_1477_17)">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M18.7787 2.31579C18.0384 3.58974 16.5469 5.4197 15.4715 6.38596C14.3907 7.35223 12.2345 8.77733 10.6728 9.56005C8.81924 10.4885 6.52256 11.0985 4.05296 11.3144L0.270197 11.6491L0 20.0162C3.5612 22.0027 5.42556 23.5196 6.44691 24.6694C7.46285 25.8246 8.9057 28.1026 9.64604 29.7328C10.4296 31.4656 11.1213 34.224 11.3051 36.3509L11.6185 40L19.9946 39.9892C21.9832 36.4319 23.5018 34.5695 24.6528 33.5493C25.8092 32.5344 28.0843 31.0931 29.7217 30.3536C31.4564 29.5709 34.2178 28.8799 36.3469 28.6964L40 28.3833L39.9892 20.0162C36.428 18.0297 34.5636 16.5128 33.5423 15.363C32.5263 14.2078 31.0943 11.9298 30.3594 10.2996C29.6244 8.66937 28.8787 5.75439 28.7004 3.82186L28.3707 0.31309L20.1243 0L18.7787 2.31579ZM26.0702 13.9039C23.393 11.2295 21.0193 6.12829 20.253 4.3823C20.1559 4.16104 19.8333 4.16104 19.7362 4.3823C18.9699 6.12828 16.5962 11.2295 13.9189 13.9039C11.2417 16.5783 6.13491 18.9495 4.38703 19.7149C4.16554 19.8119 4.16554 20.1342 4.38703 20.2312C6.13491 20.9966 11.2417 23.3677 13.9189 26.0421C16.5962 28.7165 18.9699 33.8177 19.7362 35.5637C19.8333 35.785 20.1559 35.785 20.253 35.5637C21.0193 33.8177 23.393 28.7165 26.0702 26.0421C28.7475 23.3677 33.8543 20.9966 35.6022 20.2312C35.8237 20.1342 35.8237 19.8119 35.6022 19.7149C33.8543 18.9495 28.7475 16.5783 26.0702 13.9039Z" fill="url(#paint0_linear_1477_17)"/>
            </g>
            <defs>
              <filter id="filter0_i_1477_17" x="0" y="0" width="40" height="42" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                <feFlood flood-opacity="0" result="BackgroundImageFix"/>
                <feBlend mode="normal" in="SourceGraphic" in2="BackgroundImageFix" result="shape"/>
                <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha"/>
                <feOffset dy="2"/>
                <feGaussianBlur stdDeviation="6.25"/>
                <feComposite in2="hardAlpha" operator="arithmetic" k2="-1" k3="1"/>
                <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0.0833333 0 0 0 0 1 0 0 0 0.28 0"/>
                <feBlend mode="normal" in2="shape" result="effect1_innerShadow_1477_17"/>
              </filter>
              <linearGradient id="paint0_linear_1477_17" x1="-0.00558089" y1="4.93019e-07" x2="39.9944" y2="40" gradientUnits="userSpaceOnUse">
                <stop stop-color="#2388FF"/>
                <stop offset="0.558181" stop-color="#2F6EB8"/>
                <stop offset="1" stop-color="white"/>
              </linearGradient>
            </defs>
          </svg>
          <div class="footer__left-inner">
            <div class="footer__left-block">
              <div>
                <svg xmlns="http://www.w3.org/2000/svg" width="26" height="26" viewBox="0 0 26 26" fill="none">
                  <path d="M9.28613 0.25H16.7139C17.5095 0.25 18.2733 0.566297 18.8359 1.12891C19.3984 1.69149 19.7139 2.45448 19.7139 3.25V5.82129H22.2861C23.2047 5.8214 24.0858 6.1864 24.7354 6.83594C25.385 7.48562 25.75 8.36735 25.75 9.28613V22.2861C25.7499 23.2048 25.3849 24.0858 24.7354 24.7354C24.0858 25.3849 23.2048 25.7499 22.2861 25.75H3.71387C2.79523 25.7499 1.91423 25.3849 1.26465 24.7354C0.615068 24.0858 0.250111 23.2048 0.25 22.2861V9.28613C0.25 8.36735 0.614969 7.48562 1.26465 6.83594C1.91422 6.1864 2.79527 5.8214 3.71387 5.82129H6.28613V3.25C6.28613 2.45448 6.60163 1.69149 7.16406 1.12891C7.72667 0.566297 8.49048 0.25 9.28613 0.25ZM2.53613 22.2861C2.53624 22.5986 2.65993 22.8982 2.88086 23.1191C3.10179 23.3401 3.40144 23.4638 3.71387 23.4639H22.2861C22.5986 23.4638 22.8982 23.3401 23.1191 23.1191C23.3401 22.8982 23.4638 22.5986 23.4639 22.2861V13.6787H14.6074V16.4639H11.3926V13.6787H2.53613V22.2861ZM3.71387 8.10742C3.40147 8.10753 3.10178 8.23127 2.88086 8.45215C2.65983 8.67317 2.53613 8.97356 2.53613 9.28613V11.3926H23.4639V9.28613C23.4639 8.97356 23.3402 8.67317 23.1191 8.45215C22.8982 8.23127 22.5985 8.10753 22.2861 8.10742H3.71387ZM9.28613 2.53613C9.09669 2.53613 8.91423 2.61116 8.78027 2.74512C8.64649 2.87905 8.57129 3.06069 8.57129 3.25V5.82129H17.4287V3.25C17.4287 3.06069 17.3535 2.87904 17.2197 2.74512C17.0858 2.61116 16.9033 2.53613 16.7139 2.53613H9.28613Z" fill="white" stroke="#122740" stroke-width="0.5"/>
                </svg>
              </div>
              <a href="https://hh.ru/itsolutions.moscow">hh.ru/itsolutions.moscow</a>
            </div>
            <div class="footer__left-block">
              <div>
                <svg xmlns="http://www.w3.org/2000/svg" width="26" height="23" viewBox="0 0 26 23" fill="none">
                  <path d="M1.00023 6.08065L11.917 11.3185C12.2568 11.4815 12.6263 11.5659 13.0002 11.5659C13.3742 11.5659 13.7437 11.4815 14.0835 11.3185L25.0002 6.08065M4.89212 1H21.1083C23.2578 1 25.0002 2.81975 25.0002 5.06452V17.9355C25.0002 20.1803 23.2578 22 21.1083 22H4.89212C2.74269 22 1.00023 20.1803 1.00023 17.9355V5.06452C1.00023 2.81975 2.74269 1 4.89212 1Z" stroke="white" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
                </svg>
              </div>
              <a href="mailto:itsolutions.moscow@mail.com">itsolutions.moscow@mail.com</a>
            </div>
            <div class="footer__left-block">
              <div>
                <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                  <path d="M5.13672 0.208984C5.40642 0.238706 5.66397 0.338055 5.88379 0.49707C7.30752 1.53544 8.4009 2.97637 9.3457 4.34277L10.248 5.66699C10.46 5.97635 10.557 6.35029 10.5225 6.72363C10.4879 7.09694 10.3237 7.44671 10.0586 7.71191L8.42871 9.34277L8.33105 9.44043L8.3877 9.56641C8.77174 10.4136 9.55444 11.8769 10.8398 13.1621C12.1251 14.4471 13.5888 15.2292 14.4375 15.6133L14.5635 15.6709L14.6621 15.5732L16.29 13.9434C16.5559 13.6773 16.9075 13.5129 17.2822 13.4795C17.6569 13.4461 18.0311 13.546 18.3398 13.7607H18.3408C20.0557 14.9489 22.0309 16.2444 23.4697 18.0859C23.642 18.3075 23.7517 18.5722 23.7871 18.8506C23.8225 19.1288 23.7831 19.4115 23.6719 19.6689V19.6699C22.6909 21.9581 20.2102 23.8905 17.6621 23.7969C15.9703 23.7346 11.1168 23.0706 6.02246 17.9785C0.929025 12.8849 0.266559 8.03323 0.203125 6.34082C0.113649 3.88143 1.94601 1.4611 4.13086 0.424805L4.34375 0.328125C4.59315 0.220469 4.86669 0.179278 5.13672 0.208984ZM4.79297 2.33105C4.1193 2.68294 3.46197 3.25836 2.97852 3.94434C2.49546 4.6298 2.17581 5.44114 2.20605 6.2666C2.25441 7.56312 2.77499 11.8968 7.44043 16.5615C12.1046 21.2248 16.4392 21.7455 17.7363 21.7939C18.5518 21.8236 19.3616 21.5059 20.0469 21.0273C20.7328 20.5483 21.311 19.8974 21.6621 19.2324L21.7246 19.1123L21.6367 19.0088C20.5472 17.7311 19.1316 16.7437 17.6104 15.6914L17.4727 15.5967L17.3555 15.7139C17.127 15.942 16.8804 16.2242 16.6328 16.4912C16.3808 16.763 16.1196 17.0283 15.8447 17.2461C15.2956 17.681 14.7258 17.9016 14.084 17.6416V17.6406C13.2559 17.3078 11.2085 16.3656 9.42285 14.5791C7.637 12.7924 6.69381 10.746 6.3584 9.91895C6.09871 9.2764 6.32042 8.70614 6.75684 8.15625C6.97532 7.88097 7.24115 7.61941 7.51367 7.36719C7.78131 7.11949 8.06355 6.87293 8.29199 6.64453L8.40918 6.52734L8.31641 6.39062C7.26599 4.84763 6.29176 3.39134 5.01172 2.35352L4.91016 2.27051L4.79297 2.33105Z" fill="white" stroke="#0E233D" stroke-width="0.4"/>
                </svg>
              </div>
              <a href="tel:+79450000000">+7 945 000 0000</a>
            </div>
            <div class="footer__left-block">
              <div>
                <svg xmlns="http://www.w3.org/2000/svg" width="20" height="24" viewBox="0 0 20 24" fill="none">
                  <path fill-rule="evenodd" clip-rule="evenodd" d="M9.0775 23.6737C9.0775 23.6737 0 16.4825 0 9.40646C0 6.91171 1.05357 4.51914 2.92893 2.75509C4.8043 0.991035 7.34784 0 10 0C12.6522 0 15.1957 0.991035 17.0711 2.75509C18.9464 4.51914 20 6.91171 20 9.40646C20 16.4825 10.9225 23.6737 10.9225 23.6737C10.4175 24.1111 9.58625 24.1064 9.0775 23.6737ZM10 13.5218C10.5745 13.5218 11.1434 13.4153 11.6742 13.2085C12.205 13.0017 12.6873 12.6986 13.0936 12.3164C13.4998 11.9343 13.8221 11.4806 14.042 10.9813C14.2618 10.482 14.375 9.94689 14.375 9.40646C14.375 8.86603 14.2618 8.33089 14.042 7.83159C13.8221 7.3323 13.4998 6.87863 13.0936 6.49649C12.6873 6.11434 12.205 5.81121 11.6742 5.60439C11.1434 5.39758 10.5745 5.29113 10 5.29113C8.83968 5.29113 7.72688 5.72471 6.90641 6.49649C6.08594 7.26826 5.625 8.31501 5.625 9.40646C5.625 10.4979 6.08594 11.5447 6.90641 12.3164C7.72688 13.0882 8.83968 13.5218 10 13.5218Z" fill="white"/>
                </svg>
              </div>
              <p>г. Москва, пер. Переведеновский, д. 13, стр. 18, помещ. 21Н/3</p>
            </div>
          </div>
        </div>
        <div class="footer__right">
          <div class="footer__columns">
            <div class="footer__column">
              <h6>Навигация</h6>
              <router-link :to="{ name: 'home' }">Главная</router-link>
              <p @click="scrollTo('about', 'home')">О нас</p>
              <p @click="scrollTo('system', 'home')">Системная архитектура бизнеса</p>
              <p @click="scrollTo('digital', 'home')">Цифровая разработка</p>
              <p @click="scrollTo('audit', 'home')">Аудит и консалтинг</p>
            </div>
            <div class="footer__column">
              <h6>Документация</h6>
              <router-link :to="{ name: 'policy' }">Политика <br> конфиденциальности</router-link>
            </div>
          </div>
          <p class="footer__bottom">© АЙТИ РЕШЕНИЯ 2026. Все права защищены</p>
        </div>
      </div>
    </div>
  </footer>
</template>

<script setup>
import {scroll} from "@/core/helpers/scrollTo.js";
import {useRoute, useRouter} from "vue-router";
import {computed} from "vue";

const router = useRouter()
const route = useRoute()

const actualYear = computed(() => new Date().getFullYear());

const scrollTo = (id, routeName) => {
  if (route.name === routeName) {
    scroll(id);
  } else {
    router.push({
      name: 'home',
      params: {
        locale: localStorage.getItem('user-locale') || 'en'
      }
    }).then(scroll(id));
  }
}
</script>

<style lang="scss" scoped>
.footer {
  margin-block: 100px 60px;

  &__wrapper {
    padding: 54px;
    border-radius: 60px;
    background-color: rgba(0, 0, 0, 0.00);
    background-image: url(@images/footerBg1.png);
    background-size: cover;
    background-repeat: no-repeat;
    border: 1px solid rgba(255, 255, 255, 0.3);
    display: flex;
    align-items: stretch;
    justify-content: space-between;
  }

  &__left {
    max-width: 450px;
    display: flex;
    flex-direction: column;
    gap: 50px;

    &-inner {
      display: flex;
      flex-direction: column;
      gap: 20px;
    }

    &-block {
      display: flex;
      align-items: center;
      gap: 15px;

      & div {
        flex-shrink: 0;
        border-radius: 6px;
        background-color: rgba(35, 136, 255, 0.20);
        border: 1px solid rgba(255, 255, 255, 0.3);
        width: 40px;
        height: 40px;
        display: grid;
        place-items: center;
      }

      & p, a {
        color: #FFF;
        line-height: 110%;
        text-align: justify;
        font-family: Onest, sans-serif;
        font-size: 20px;
        font-weight: 400;
      }

      & a {
        transition: 0.2s;

        @include hover {
          color: #2388FF;
        }
      }
    }
  }

  &__title {
    margin-bottom: 60px;
    color: #FFF;
    font-family: "Gros Ventre", sans-serif;
    font-size: 30px;
    font-weight: 400;
  }

  &__right {
    display: flex;
    flex-direction: column;
    justify-content: space-between;
  }

  &__bottom {
    color: #FFF;
    text-align: right;
    font-family: Onest, sans-serif;
    font-size: 16px;
    font-weight: 400;
  }

  &__columns {
    display: flex;
    align-items: flex-start;
    gap: 100px;
  }

  &__column {
    display: flex;
    flex-direction: column;
    gap: 15px;

    & h6 {
      color: #FFF;
      font-family: "Gros Ventre", sans-serif;
      font-size: 24px;
      font-weight: 600;
    }

    & p, a {
      cursor: pointer;
      transition: 0.2s;
      color: #FFF;
      font-family: Onest, sans-serif;
      font-size: 20px;
      font-weight: 400;

      @include hover {
        color: #2388FF;
      }
    }
  }
}

@media (max-width: 1300px) {
  .footer {
    &__wrapper {
      flex-direction: column;
      align-items: center;
      gap: 50px;
    }

    &__left {
      align-items: center;
    }

    &__column {
      align-items: center;

      & p, a {
        text-align: center;
      }
    }
  }
}

@media (max-width: 900px) {
  .footer {
    &__columns {
      flex-direction: column;
      align-items: center;
      gap: 50px;
    }

    &__left {
      &-block {
        & a, p {
          font-size: 14px;
        }
      }
    }

    &__bottom {
      margin-top: 75px;
      text-align: center;
    }
  }
}
</style>